# ------------------------------------------------------------
# Написать программу получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ]
# ------------------------------------------------------------
import math

n = int(input("Введите число N: "))
result = []
for i in range(1, n + 1):
    result.append(int(math.factorial(i)))
print(*result, sep=', ')

