# ------------------------------------------------------
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# ------------------------------------------------------
# Вариант 1: через bin()
# ------------------------------------------------------

num_dec = int(input('Введите число: '))
print(bin(num_dec))

# ------------------------------------------------------
# Вариант 2
# ------------------------------------------------------

num_dec = int(input('Введите число: '))
 
num_bin = ''
 
while num_dec > 0:
    num_bin = str(num_dec % 2) + num_bin
    num_dec = num_dec // 2
 
print(f"Введенное число в двоичной системе счисления:", num_bin)