# ------------------------------------------------------
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# *Пример:*
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 
# ------------------------------------------------------

n = int(input('Задайте число для построения ряда: '))

def fibonacci(n):
    if n >= 0:
        fib = range(n + 1)
        f = [0, 1]
        for k in fib[2:]:
            f.append(f[k - 1] + f[k - 2]) 
        return f[n]
    else:
        n = -(n - 1)
        fib = range(n + 1)
        f = [1, 0]
        for k in fib[2:]:
            f.append(f[k - 2] - f[k - 1]) 
        f.reverse()
        return f[0]

for i in range(-n, n + 1):
    print(fibonacci(i), end='  ')