# ------------------------------------------------------
# 3 Задайте последовательность чисел. Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности.
# ------------------------------------------------------

numbers = [1, 5, 5, 6, 8, 8, 0]
unique_numbers = []
for num in numbers:
    if num not in unique_numbers:
        unique_numbers.append(num)
print(f'Список уникальных чисел: {unique_numbers}')