# ---------------------------------------
# stationery = ['карандаш','ручка','линейка']

# # 1 вариант

# for i in range(len(stationery)):
#     print(stationery[i])

# # 2 вариант

# for i in stationery:
#     print(i)

# ---------------------------------------
# numbers = [2, 5, 3, 7, 1]
# result = numbers[0]
# for num in numbers:
#     if num > result:
#         result = num
# print(result)

# ---------------------------------------
# for i in range(-2, 3):
#     print(i, end = ' // ')

# ---------------------------------------
# list = ['frost','snow','rain']
# print(list[1][1])

# ---------------------------------------
# list = ['1','2','3']
# list.append('добавка')
# print(list)

# ---------------------------------------
# def p(x):
#     if x > 0:
#         return f'{x} больше 0'
# print(p(5))  
           
# ---------------------------------------
# 1.Напишите программу, которая принимает на вход число N 
# и выдаёт последовательность из N членов. Для N = 5: 1, -3, 9, -27, 81
# ---------------------------------------
# 1 вариант
# ---------------------------------------

# n = int(input("Введите натуральное число n "))
# result = ""
# sign = 1
# for i in range(0, n):
#     result += str(3 ** i * sign)
#     result += ", "
#     sign = -sign
# print(result[0:(len(result) - 2)])

# ---------------------------------------
# 2 вариант
# ---------------------------------------
# n = int(input("Введите натуральное число N: "))
# result = "1, "
# res = 1
# for i in range(1, n):
#     res *= (-3)
#     result += str(res)
#     result += ", "
# print(result[0:(len(result) - 2)])

# ---------------------------------------
# 2.Для натурального n создать список, состоящий из элементов последовательности 3n + 1
# Пример: для n = 6: [4, 7, 10, 13, 16, 19]
# ---------------------------------------

n = int(input("Введите натуральное число N: "))
result = []
for i in range(1, n + 1):
    result.append(3*i + 1)
print(*result, sep=', ')
# print(*result, sep=', ') # "*" дает распаковка списка, sep= разделитель
# print('итого получено'.capitalize()) # первая прописная
# print('итого получено'.upper())      # все заглавные
# print('итого получено'.title())

# ---------------------------------------
# 3.Напишите программу, в которой пользователь будет задавать две строки, а программа -
# определять количество вхождений одной строки в другой.
# ---------------------------------------

# # print(chr(1108))
# # print(ord('а'))
# import random
# first_string = ""
# for i in range(50):
#     first_string += chr(random.randint(1070, 1100))
# print(first_string)


# # first_string = input("Введите первую строку: ")
# second_string = input("Введите вторую строку: ")
# result = first_string.count(second_string)
# print(f'Количество вхождений второй строки в первую:  {result}')





